# Numpy & Paandas Application

In [63]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

<div class="alert alert-info" style="margin: 20px">

### Suppose df1 is a mid-term result of a class, and df2 is a final result of a class
### 1. take the sumation of two DataFrame then take the Avg for each person.
### 2. simulate one student has cheated on the final exam, give this student a 0
### 3. bounus all students that not cheated on the exam by adding 10

In [36]:
df1 = pd.DataFrame(np.random.randint(50,100,16).reshape((4,4)))
df1.index = ['student1','student2','student3','student4']
df1.columns = ['math','english','python','statistics']
df1

          math  english  python  statistics
student1    78       84      98          99
student2    53       94      65          51
student3    77       92      58          84
student4    83       85      55          89

In [37]:
df2 = pd.DataFrame(np.random.randint(50,100,16).reshape((4,4)))
df2.index = ['student1','student2','student3','student4']
df2.columns = ['math','english','python','statistics']
df2

          math  english  python  statistics
student1    74       88      98          76
student2    74       81      94          91
student3    68       80      69          64
student4    87       65      94          58

In [38]:
final_result = (df1+df2)/2
final_result

          math  english  python  statistics
student1  76.0     86.0    98.0        87.5
student2  63.5     87.5    79.5        71.0
student3  72.5     86.0    63.5        74.0
student4  85.0     75.0    74.5        73.5

In [53]:
final_result.loc['student1'] = 0
final_result

          math  english  python  statistics
student1   0.0      0.0     0.0         0.0
student2  63.5     87.5    79.5        71.0
student3  72.5     86.0    63.5        74.0
student4  85.0     75.0    74.5        73.5

In [54]:
(final_result[final_result != final_result.loc['student1']]+10).fillna(0)

          math  english  python  statistics
student1   0.0      0.0     0.0         0.0
student2  73.5     97.5    89.5        81.0
student3  82.5     96.0    73.5        84.0
student4  95.0     85.0    84.5        83.5

<div class="alert alert-info" style="margin: 20px">

### when it comes to time series data, fillig is a good method to keep the series continuous

In [60]:
S = pd.Series([0.11, 0.12, 0.13], index=[0, 1, 3])
S


S.reindex(range(0,5)) # in order to handle these missing values. now introducing backword/forward filling



S.reindex(range(0,5),method = 'ffill')

0    0.11
1    0.12
3    0.13
dtype: float64

0    0.11
1    0.12
2     NaN
3    0.13
4     NaN
dtype: float64

0    0.11
1    0.12
2    0.12
3    0.13
4    0.13
dtype: float64

In [81]:
# we can also adopt this method to a DataFrame 
df = DataFrame(np.random.randint(0,2,9).reshape((3, 3)), 
                  index=['house1', 'house2', 'house3'],
                  columns=['bedroom', 'bathroom', 'livingroom'])
df

df.reindex(index = ['house1','house2','house3','house4'], method='ffill')

        bedroom  bathroom  livingroom
house1        0         0           1
house2        1         0           0
house3        0         1           1

        bedroom  bathroom  livingroom
house1        0         0           1
house2        1         0           0
house3        0         1           1
house4        0         1           1

<div class="alert alert-info" style="margin: 20px">


### Define a function that product two list of elements as DataFrame

In [144]:
# Traditional way
def as_DataFrame(list1,list2):
    lst = []
    for i in range(len(list1)):
        for j in range(len(list2)):
            lst.append(str(list1[i])+str(list2[j]))
    return DataFrame(np.array(lst).reshape(2,2), index =list1, columns=list2 )





# Comprehension way
def As_DataFrame(list1,list2):
    data = {i:[str(j)+str(i) for j in list1] for i in list2}
    return DataFrame(data, index=list1, columns = list2)

In [145]:
as_DataFrame(['A','B'],['1','2'])
As_DataFrame(['A','B'],['1','2'])

    1   2
A  A1  A2
B  B1  B2

    1   2
A  A1  A2
B  B1  B2


<div class="alert alert-info" style="margin: 20px">

### scrap web table into dataset

In [157]:

data =pd.read_html('https://en.wikipedia.org/wiki/Fortune_Global_500')[6]
data

,0,1,2,3,4
0,Industry,Company,Country,Rank,Revenue ($M)
1,Aerospace & Defense,Boeing,United States,64,93392
2,Airlines,American Airlines,United States,260,42207
3,Apparel,Christian Dior,France,208,49221
4,Banks: Commercial & Savings,Industrial & Commercial Bank,China,26,153021
5,Beverages,Anheuser-Busch InBev,Belgium,170,56444
6,"Building Materials, Glass",Saint-Gobain,France,231,46002
7,Chemicals,BASF,Germany,112,72677
8,Computer Software,Microsoft,United States,71,89950
9,"Computers, Office Equipment",Apple,United States,11,229234
10,Construction & Farm Machinery,Caterpillar,United States,238,45462
11,Diversified Financials,EXOR Group,Netherlands,19,161677
12,"Electronics, Electrical Equipment",Samsung Electronics,South Korea,12,211940
13,Energy,Gazprom,Russia,49,111983
14,Engineering & Construction,China Construction Engineering,China,23,156071
15,Entertainment,Disney,United States,176,55137
16,Food & Drug Stores,Kroger,United States,39,122662
17,Food Consumer Products,Nestle,Switzerland,69,91222
18,Food Production,Archer Daniels Midland,United States,152,60828
19,Food Services,Compass Group,United Kingdom,413,28578
20,General Merchandisers,Walmart,United States,1,500343
21,Health Care: Insurance & Managed Care,UnitedHealth Group,United States,15,201159
22,Health Care: Medical Facilities,HCA Healthcare,United States,215,47653
23,Health Care: Pharmacy & Other Services,CVS Health,United States,17,184765
24,Household & Personal Products,Procter & Gamble,United States,135,66217
25,Human Resources & Employment Services,Adecco Group,Switzerland,441,26670
26,Industrial Machinery,General Electric,United States,41,122274
27,Information Technology Services,IBM,United States,92,79139
28,"Insurance: Life, Health (Mutual)",Nippon Life Insurance,Japan,126,68684
29,"Insurance: Life, Health (Stock)",AXA,France,27,149461
30,Insurance: Property & Casualty (Mutual),State Farm Insurance,United States,95,78331
31,Insurance: Property & Casualty (Stock),Berkshire Hathaway,United States,10,242137
32,Internet Services & Retailing,Amazon.com,United States,18,177866
33,"Mail, Package, & Freight Delivery",China Post Group,China,113,72197
34,Medical Products & Equipment,Medtronic,Ireland,396,29710
35,Metals,China Minmetals,China,109,72997
36,"Mining, Crude-Oil Production",Glencore,Switzerland,14,205476
37,Motor Vehicles & Parts,Toyota Motor,Japan,6,265172
38,Network & Other Communications Equipment,Huawei Investment & Holding,China,72,89311
39,"Oil & Gas Equipment, Services",Schlumberger,United States,386,30440
40,Petroleum Refining,Sinopec Group,China,3,326953
41,Pharmaceuticals,China Resources,China,86,82184
42,Pipelines,Energy Transfer Equity,United States,217,47487
43,Railroads,Deutsche Bahn,Germany,211,48124
44,Real Estate,China Evergrande Group,China,230,46019
45,Semiconductors & Other Electronic Components,Intel,United States,146,62761
46,Shipping,China Shipbuilding Industry,China,245,44431
47,Specialty Retailers,Home Depot,United States,57,100904
48,Telecommunications,AT&T,United States,20,160546
49,Textiles,Shandong Weiqiao Pioneering,China,185,53203
50,Tobacco,Philip Morris International,United States,411,28748
51,Trading,Trafigura Group,Singapore,32,136421
52,Utilities,State Grid,China,2,348903
53,Wholesalers: Electronics & Office Equipment,Tech Data,United States,315,36775
54,Wholesalers: Food & Grocery,Sysco,United States,174,55371
55,Wholesalers: Health Care,McKesson,United States,13,208357

In [158]:
lines = 81+157

In [159]:
print('lines of code %i'%lines)

lines of code 238